Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ། ཕ་བསད་པ་དང་། མ་བསད་པ་དང་། དགྲ་བཅོམ་པ་བསད་པ་དང་། གནོད་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་མཚལ་ཕྱུང་བ་དང་། དགེ་འདུན་འཐུན་པ་བཤིག་པ་དང་། རྐུན་བུར་རབ་ཏུ་བྱུང་བ་དང་། དབང་པོ་མ་ཚང་བ་དང་། དབང་པོ་གཉིས་དང་ལྡན་པ་དང་། ལོག་པར་ལྟ་བ་དང་། ལོག་པར་སེམས་པ་དང་། ལོག་པར་སྨྲ་བ་དང་། ལོག་པའི་ལམ་ཅན་དང་། ལོག་པས་འཚོ་བ་དང་། ལོག་པར་བརྩོན་པ་དང་། །ལོག་པའི་དྲན་པ་ཅན་དང་། ལོག་པའི་ཏིང་ངེ་འཛིན་ལ་གནས་པ་དང་། གནས་མི་ཤེས་པ་དང་། །དུས་མི་ཤེས་པ་དང་། ཚོད་མི་ཤེས་པ་དང་། ལམ་མི་ཤེས་པ་དང་། ཚད་མི་ཤེས་པ་དང་། བདག་དང་གཞན་མི་ཤེས་པ་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། བསླབ་པའི་གནས་རྣམས་ལ་གུས་པ་མེད་པ་དང་། བག་ཡོད་པ་དང་སྤྱོད་ཡུལ་ཁྱད་པར་དུ་འཕགས་པ་དག་ལ་བཙུན་པར་མི་འཛིན་པ་དང་། ཆོས་མི་ཤེས་པ་དང་། འདུལ་བ་མི་ཤེས་པ་དང་། བསླབ་པའི་གནས་མི་ཤེས་པ་དང་། ཁ་ན་མ་ཐོ་བ་དང་ལྕི་བ་དང་ཡང་བ་མི་ཤེས་པ་དང་། ཚུལ་ཁྲིམས་ཉམས་པ་དང་རལ་པ་མི་ཤེས་པ་དང་། གཞན་ཡང་སྤྱོད་པ་ཤིན་ཏུ་ཕྲ་བ་དང་རགས་པ་མི་ཤེས་པ་དང་། ལས་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་མི་ཤེས་པ་དང་། དངོས་པོ་དམན་པ་རྣམས་མི་ཤེས་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པའི་བསྔགས་པ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ལ་སྐུར་པ་འདེབས་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་བསྒྲུབ་པར་བསྐུལ་བ་དང་། བླ་ན་མེད་པའི་ལམ་ཡང་དག་པ་ལ་སྐྱོ་ཞིང་སྤོང་བར་བྱེད་པ་དང་། ཚུལ་ཁྲིམས་ཉམས་པ་དང་། ལྟ་བ་ཉམས་པ་དང་། སྤྱོད་ལམ་ཉམས་པ་དང་། ལམ་མ་ཡིན་པ་སྤྱོད་པ་དང་། བདག་ཡོད་པར་སྨྲ་བ་དང་། སེམས་ཅན་ཡོད་པར་སྨྲ་བ་དང་། སྲོག་ཡོད་པར་སྨྲ་བ་དང་། གང་ཟག་ཡོད་པར་སྨྲ་བ་དང་། བསམ་པ་ཤིན་ཏུ་དམན་ཞིང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེད་པར་བྱེད་པ་དང་། ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བ་དང་། སྟོང་ཞིང་རྒྱུ་མེད་པར་ལྟ་བ་དང་། ཡོད་པ་མི་མཐོང་བ་དང་། མེད་པ་མི་མཐོང་བ་དང་། ལས་མི་མཐོང་བ་དང་། བརྩོན་འགྲུས་མི་མཐོང་བ་དང་། ལས་མི་ཤེས་པ་དང་། ལས་ཀྱི་རྒྱུ་མི་ཤེས་པ་དང་། རྣམ་པར་སྨིན་པ་མི་ཤེས་པ་དང་། རྣམ་པར་སྨིན་པའི་རྒྱུ་མི་ཤེས་པ་དང་། དབང་པོ་རྣམས་མི་ཤེས་པ་དང་། དབང་པོ་རྣམས་ཀྱི་རྒྱུ་མི་ཤེས་པ་དང་། ཁམས་མི་ཤེས་པ་དང་། ཁམས་ཀྱི་རྒྱུ་མི་ཤེས་པ་དང་། རྣམ་པར་གྲོལ་བ་མི་ཤེས་པ་དང་། རྣམ་པར་གྲོལ་བའི་རྒྱུ་མི་ཤེས་པ་དང་། ལམ་མི་ཤེས་པ་དང་། ལམ་གྱི་རྒྱུ་མི་ཤེས་པ་དང་། ཉོན་མོངས་པ་མི་ཤེས་པ་དང་། ཉོན་མོངས་པའི་རྒྱུ་མི་ཤེས་པ་དང་། གཏོང་བ་མི་ཤེས་པ་དང་། གཏོང་བའི་རྒྱུ་མི་ཤེས་པ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་མི་ཤེས་པ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་རྒྱུ་མི་ཤེས་པ་དང་། སྐྱེ་ཤི་མི་ཤེས་པ་དང་། སྐྱེ་ཤིའི་རྒྱུ་མི་ཤེས་པ་དང་། ཟག་པ་དང་བཅས་པ་མི་ཤེས་པ་དང་། ཟག་པ་དང་བཅས་པའི་རྒྱུ་མི་ཤེས་པ་དང་། ཟད་པ་དང་ཟད་པ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། ཡོད་པ་དང་ཡོད་པ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། མཐའ་དང་མཐའ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། དབེན་པ་དང་དབེན་པ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། འཇུག་པ་དང་འཇུག་པ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། ངོ་བོ་ཉིད་དང་ངོ་བོ་ཉིད་མ་ཡིན་པ་མི་ཤེས་པ་དང་། སྐྱེ་བ་དང་སྐྱེ་བ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། འགག་པ་དང་འགག་པ་མ་ཡིན་པ་མི་ཤེས་པ་གང་ཡིན་པ་སྟེ། གཞོན་ནུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གོང་དུ་ཇི་སྐད་དུ་བསྟན་པའི་གཟུངས་མངོན་པར་བསྒྲུབ་པར་འདོད་པས་ཆོས་མ་ཡིན་པ་སྤྱོད་པའི་གང་ཟག་བརྒྱད་ཅུ་པོ་འདི་དག་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: Those who have killed their father, ( ) those who have killed their mother, (3) those who have killed a worthy one, (4) those who with harmful intent have drawn blood from a thus-gone one, (5) those who destroy the harmony of the saṅgha, (6) those who have run away to live as robbers, (7) those with impaired faculties, (8) those with only two sense faculties, (9) those who have wrong views, (10) those with wrong intention, (11) those with improper speech, (1 ) those who follow wrong paths, (13) those with wrong livelihood, (14) those with wrong effort, (15) those with wrong mindfulness, (16) those with wrong absorption, (17) those who do not know what is correct, (18) those who do not know the right time, (19) those who do not know the right amount, ( 0) those who do not know the right path, ( 1) those who do not know the right measure, ( ) those who do not understand self and others, ( 3) those who have no respect for the Buddha, the Dharma, the Saṅgha, and the precepts, ( 4) those who do not consider carefulness and the exalted domains to be noble, ( 5) those who do not know the Dharma, ( 6) those who do not know the Vinaya, ( 7) those who do not know the precepts, ( 8) those who do not know heaviness and lightness with respect to wrongdoings, ( 9) those who do not know what are corrupted and ruined forms of discipline, (30) those who do not know the very subtle and coarse types of conduct, (31) those who do not know future and present actions, (3 ) those who do not know what are inferior matters, (33) those who proclaim the praises of the hearers’ vehicle and denigrate the Dharma of the thus-gone ones, (34) those who encourage others to accomplish the vehicle of the solitary buddhas, (35) those who are weary of and abandon the true and unsurpassed path, (36) those with corrupted discipline, (37) those with perverted views, (38) those with corrupted behavior, (39) those who practice what is not the path, (40) those who profess the view of a self, (41) those who profess the view of a sentient being, (4 ) those who profess the view of a life principle, (43) those who profess the view of a person, (44) those with inferior motivation who give rise to desire, anger, and ignorance, (45) those who adhere to nihilistic views, (46) those who adhere to eternalistic views, (47) those who adhere to the view that everything is void and causeless, (48) those who do not see the existent, (49) those who do not see the nonexistent, (50) those who do not perceive actions, (51) those who do not perceive diligence, (5 ) those who do not understand actions, (53) those who do understand the causes of actions, (54) those who do not understand karmic ripening, (55) those who do not understand the causes of karmic ripening, (56) those who do not understand the sense faculties, (57) those who do not understand the causes of the sense faculties, (58) those who do not understand the elements, (59) those who do not understand the causes of the elements, (60) those who do not understand liberation, (61) those who do not understand the causes of liberation, (6 ) those who do not understand the path, (63) those who do not understand the causes of the path, (64) those who do not understand afflictions, (65) those who do not understand the causes of afflictions, (66) those who do not understand generosity, (67) those who do not understand the causes of generosity, (68) those who do not understand the past and future limits, (69) those who do not understand the causes of the past and future limits, (70) those who do not understand birth and death, (71) those who do not understand the causes of birth and death, (7 ) those who do not understand the defiled, (73) those who do not understand the causes of the defiled, (74) those who do not understand exhaustion and non-exhaustion, (75) those who do not understand existence and nonexistence, (76) those who do not understand limit and non-limit, (77) those who do not understand disengagement and non- disengagement, (78) those who do not understand cognition and noncognition, (79) those who do not understand the essential nature and that which is not the essential nature, (80) those who do not understand arising and non-arising, and (81) those who do not understand cessation and non-cessation—Kumāra, those noble sons or daughters who wish to accomplish the dhāraṇīs that were revealed earlier should stay away from those eighty types of persons who engage in ways that are contrary to the Dharma.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke these verses:

source: གང་ཞིག་མིག་གི་སྐྱེ་མཐའ་དང་། །ཟད་མཐའ་དག་ནི་མི་རྟོགས་པ།
en: “Those who do not understand The limit of the arising of the eye and the limit of its exhaustion

source: །དེ་ནི་ཀུན་འཛིན་ལ་རྨོངས་པས།
en: Are deluded with respect to thorough comprehension;

source: །མཁས་པས་ཡོངས་སུ་སྤང་བར་བྱ།
en: The wise should therefore stay away from them. “Those who realize that the eye

source: །གང་ཞིག་མིག་ལ་བདག་མེད་དང་། །སེམས་ཅན་མེད་པར་རྟོགས་གྱུར་པ།
en: Is devoid of a self and a sentient being

source: །དེས་ནི་ཀུན་འཛིན་ལ་གནས་པས།
en: Abide by thorough comprehension;

source: །མཁས་པས་ཡོངས་སུ་བསྟེན་པར་བྱ།
en: The wise should therefore attend to them. “Those who realize that the eye

source: །གང་ཞིག་མིག་ནི་སྐྱེ་ཟད་དང་། །ཡི་གེ་སྤངས་པར་རྟོགས་གྱུར་པ།
en: Transcends birth, exhaustion, and words

source: །དེ་ནི་ཀུན་འཛིན་ལ་གནས་པས།
en: Abide by thorough comprehension;

source: །གང་ཞིག་མིག་ནི་དབེན་པ་དང་། །གནས་པ་མེད་པར་རྟོགས་གྱུར་བ།
en: “Those who realize that the eye Is disengagement and nonabiding

source: །གང་ཞིག་མིག་གི་རང་བཞིན་ཉིད། །གནས་པ་མེད་པར་རྟོགས་གྱུར་པ།
en: That the nature of the eye is nonabiding

source: །གང་ཞིག་མིག་ལ་འཇུག་མེད་དང་། །གཟུགས་ཀྱི་མཚན་ཉིད་མེད་རྟོགས་པ།
en: Is beyond engagement and devoid of the characteristics of form

source: །གང་ཞིག་མིག་ལ་སྐྱེ་མེད་དང་། །རང་བཞིན་ཞི་བར་རྟོགས་གྱུར་པ།
en: “Those who realize that the eye Is unborn and intrinsically peace

source: །གང་ཞིག་མིག་ནི་རང་བཞིན་གྱིས།
en: “Those who realize that the eye intrinsically lacks the marks of the eye

source: །མིག་གི་མཚན་ཉིད་སྤངས་པས་ན། །སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས་པ་དང་། །བསྟན་དུ་མེད་པར་རྟོགས་གྱུར་པ།
en: Are praised by the buddhas, and they realize that the eye is undefinable;

source: །མཁས་པས་ཡོངས་སུ་བསྟེན་པར་བྱ། །གང་ཞིག་མིག་ནི་རང་བཞིན་གྱིས།
en: So the wise should therefore attend to them.

source: །མིག་གི་མཚན་ཉིད་སྤངས་པས་ན།
en: “Those who realize that the eye intrinsically lacks the marks of the eye

source: །སུ་ཡང་སེམས་ཤིང་འཛིན་པ་དང་། །བཤད་དུ་མེད་པར་རྟོགས་གྱུར་པ།
en: Realize that it is beyond the reach of thoughts, apprehending, and explanations;

source: །དེ་བཞིན་གཟུངས་ཀྱི་ངོ་བོ་ཉིད།
en: “Likewise, since the essential nature of dhāraṇīs

source: །ཡི་གེས་བརྗོད་བྱ་མ་ཡིན་པས།
en: Cannot be expressed in words,

source: །ཕྱོགས་ཀྱང་ཡོད་པ་མ་ཡིན་ལ།
en: It is devoid of sides

source: །སེམས་ཀྱིས་ཀྱང་ནི་ཕྱིར་མི་འགྱུར།
en: And will not be reached by the mind.

source: །ཆོས་དེ་ལ་ནི་དགའ་བ་མེད།
en: “That Dharma is beyond joy

source: །ཞེ་སྡང་ལ་ཡང་གནས་པ་མིན།
en: And does not dwell on anger;

source: །རི་རྒྱལ་བཞིན་དུ་མི་གཡོ་བས།
en: Since it is unshakable like the king of mountains,

source: །རྗོད་པར་བྱེད་ཀྱང་དམིགས་སུ་མེད།
en: It cannot be apprehending, even if it is expressed.

source: །ཀུན་འཛིན་ཡང་དག་ཡོད་མ་ཡིན།
en: “Both thorough comprehension and the self

source: །བདག་ཀྱང་ཡོད་པ་མ་ཡིན་ཏེ།
en: Do not truly exist;

source: །གལ་ཏེ་བདག་ནི་རང་བཞིན་སྟོང་།
en: Since the self is intrinsically empty,

source: །ཀུན་འཛིན་ཡང་ནི་ཡོད་མི་འགྱུར།
en: Thorough comprehension is also nonexistent.

source: །ཀུན་འཛིན་རང་བཞིན་སྟོང་ཡིན་ན།
en: “Thorough comprehension is intrinsically empty,

source: །བྱིས་པས་ཡོད་པར་རབ་ཏུ་བརྟགས།
en: But immature beings consider it something existent.

source: །ཡང་དག་མ་ཡིན་བརྟགས་པས་ན།
en: Since their conceptions are improper,

source: །མ་ཐོས་པར་ཡང་མྱ་ངན་སྐྱེད།
en: They do not study, and experience misery.

source: །གང་ཞིག་འདོད་དང་ཀུན་འཛིན་དག །སྟོང་པ་ཉིད་དུ་རྣམ་རྟོག་པ།
en: “Some think that both desire And thorough comprehension are empty;

source: །རྟོག་པ་གཉིས་པོ་དེ་དག་ཀྱང་།
en: Ultimately, however, those two thoughts themselves

source: །མཐར་ནི་གང་ཡང་དམིགས་མི་འགྱུར།
en: Are also completely beyond apprehension.

source: །གལ་ཏེ་སྟོང་ཉིད་སྟོང་རྟོགས་ན།
en: “If emptiness is realized to be empty,

source: །ཀུན་འཛིན་དག་ཀྱང་ཡོད་མི་འགྱུར།
en: Thorough comprehension is also nonexistent,

source: །བྱང་ཆུབ་ཡན་ལག་བར་དག་དང་། །ཏིང་འཛིན་དག་ཀྱང་སྟོང་པ་ཡིན།
en: And everything up to the factors of awakening And absorption is also empty. “Those who understand

source: །གང་ཞིག་ཀུན་འཛིན་སྟོང་ཉིད་དང་། །ཏིང་འཛིན་དག་གི་བར་དག་ཀྱང་།
en: Thorough comprehension, emptiness,

source: །རབ་ཏུ་རྟོགས་པར་གྱུར་ན་ནི།
en: And everything up to absorption

source: །མིག་ཀྱང་རབ་ཏུ་རྟོགས་པར་གྱུར།
en: Will also genuinely understand the eye. “Those who genuinely realize

source: །གང་ཞིག་མིག་ནི་ཟད་པའི་མཐའ། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The limit of the exhaustion of the eye

source: །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Will finally perfect The gateway of thorough comprehension. “Those who genuinely realize

source: །གང་ཞིག་མིག་ནི་སྐྱེ་བའི་མཐའ།
en: The limit of the arising of the eye

source: །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན།
en: Will finally realize

source: །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The gateway of thorough comprehension.

source: །མཐར་ནི་ཡོངས་སུ་རྟོགས་པར་བྱེད།
en: “Those who genuinely realize

source: །གང་ཞིག་མིག་གི་མཐའ་ཡི་རྣམས། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The limit of the eye

source: །གང་ཞིག་མིག་ནི་རབ་དབེན་པ།
en: The gateway of thorough comprehension.

source: །གང་ཞིག་མིག་གི་འཇུག་པ་དག །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The cognition of the eye

source: །གང་ཞིག་མིག་ནི་ཡོད་མིན་པ། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The nonexistence of the eye

source: །གང་ཞིག་མིག་ནི་ཉེར་ཞི་བ།
en: The gateway of thorough comprehension.

source: །གང་ཞིག་མིག་ནི་འགྱུར་བ་ཡི།
en: “Those who genuinely realize

source: །ཟད་མཐའ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The limit of the exhaustion of the eye’s transformations

source: །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །སྐྱེ་མཐའ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The limit of the arising of the eye’s transformations

source: །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི།
en: The limit of the eye’s transformations

source: །མཐར་ནི་ཡང་དག་བཞིན་རྟོགས་ན།
en: Will finally perfect

source: །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །རབ་དབེན་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The disengagement of the eye’s transformations

source: །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །འཇུག་པ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The cognition of the eye’s transformations

source: །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །མེད་པ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The nonexistence of the eye’s transformations

source: །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །སྐྱེ་མེད་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The unborn nature of the eye’s transformations

source: གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །ཉེར་ཞི་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ།
en: The peace of the eye’s transformations

source: །འཇིག་རྟེན་སྐྱེ་བའི་མིང་གི་བར། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།
en: Up to the names produced in the world. “Those who do not adopt or entertain the idea

source: །གང་ཞིག་མིག་གི་སྔོན་མཐའ་ལ།
en: That the past limit of the eye

source: །འགྱུར་དང་ཐ་དད་མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ།
en: Is unchanging and devoid of distinct characteristics

source: །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན།
en: Dwell within the gateway of thorough comprehension. “Those who do not adopt or entertain the idea

source: །གང་ཞིག་མིག་གི་ཟད་མཐའ་ལ།
en: That the limit of the exhaustion of the eye

source: །གང་ཞིག་མིག་གི་སྐྱེ་མཐའ་ལ།
en: That the limit of the arising of the eye

source: །གང་ཞིག་མིག་གི་མཐའ་དག་ལ།
en: That the limit of the eye

source: །གང་ཞིག་མིག་གི་ཉེར་ཞི་ལ།
en: That the peace of the eye

source: །གང་ཞིག་མིག་གི་འཇུག་པ་ལ།
en: That the cognition of the eye

source: །གང་ཞིག་མིག་གི་མེད་པ་ལ།
en: That the nonexistence of the eye

source: །གང་ཞིག་མིག་གི་སྐྱེ་མེད་ལ།
en: That the unborn nature of the eye

source: །འདོད་སྡང་གཏི་མུག་ང་རྒྱལ་ཆེ།
en: Desire, anger, ignorance, great pride,

source: །ཕྲག་དོག་སེར་སྣ་སྒྱུ་མྱ་ངན།
en: Envy, miserliness, deceit, misery,

source: །ཉེས་དམིགས་དྲི་མ་ཟུག་རྔུ་དང་། །ཆུ་བོ་དཀར་ནག་ལས་རྣམས་དང་། །སྐྱེ་བ་མེད་དང་འགག་མེད་དང་། །འགྲོ་བ་མེད་དང་འོང་མེད་དང་། །མིག་ཡོ་ཐ་དད་མི་འགྱུར་དང་། །བྱས་མིན་སྤྱོད་པ་མ་ཡིན་དང་། །སྣང་མིན་མུན་པ་མ་ཡིན་དང་། །འཇུག་མིན་ཆུ་བོ་སྤངས་པ་དང་། །ཟག་པ་མེད་དང་གནས་མེད་དང་། །འགྲོ་མིན་མི་འགྲོ་མ་ཡིན་དང་། །ཡི་གེ་མ་ཡིན་དམིགས་མིན་དང་། །འབྱུང་བ་མ་ཡིན་འཇུག་མིན་དང་། །ཡང་དག་མ་ཡིན་རྣམ་རྟོག་སོགས།
en: “Defects, stains, pain, the rivers, wholesome and unwholesome actions, The absence of arising, the absence of cessation, The absence of going, the absence of coming, The unmoving, the undifferentiated, “The uncreated, the absence of action,

source: །སྒོ་ནི་དྲུག་ཅུ་རྩ་གཉིས་རྣམས།
en: That which is neither luminous nor dark, The absence of engagement, that which transcends the rivers, The undefiled, the nonabiding,

source: །སོ་སོའི་དོན་དང་ཅི་རིགས་པར།
en: “That which is beyond going and non-going, That which is beyond words, that which is beyond apprehending, That which is beyond origination, that which is beyond engagement,

source: །གང་ཞིག་མིག་གི་སྔོན་མཐའ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the past limit of the eye

source: །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ།
en: Without adopting or entertaining ideas about it

source: །གང་ཞིག་མིག་གི་ཟད་མཐའ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the limit of the exhaustion of the eye

source: །གང་ཞིག་མིག་གི་སྐྱེ་མཐའ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the limit of the arising of the eye

source: །གང་ཞིག་མིག་གི་མཐའ་དག་གི །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the limit of the eye

source: །གང་ཞིག་མིག་གི་རབ་དབེན་པའི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the disengagement of the eye

source: །གང་ཞིག་མིག་གི་འཇུག་པ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the cognition of the eye

source: །གང་ཞིག་མིག་ནི་མེད་པ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the nonexistence of the eye

source: །གང་ཞིག་མིག་ནི་མི་སྐྱེ་བའི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the unborn nature of the eye

source: །གང་ཞིག་མིག་གི་ཉེར་ཞི་བའི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་།
en: Of the peace of the eye

source: །ས་ལ་འགྱུར་བ་མེད་པ་དང་། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི།
en: “Those who realize that earth is unchanging Without adopting

source: །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ།
en: Or entertaining ideas about it

source: །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད།
en: Will perfect the gateway of thorough comprehension.

source: །ས་ནི་མི་སྐྱེ་འདུ་ཤེས་ཤིང་།
en: “Those who perceive that earth is unborn

source: །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི།
en: And realize this without adopting

source: །ས་ནི་འགག་མེད་འདུ་ཤེས་ཤིང་།
en: “Those who perceive that earth is unceasing

source: །ས་ལ་འཇུག་པར་འདུ་ཤེས་ཤིང་།
en: “Those who perceive the cognition of earth

source: །ས་ལ་ངེས་འབྱུང་འདུ་ཤེས་ཤིང་།
en: “Those who perceive emancipation related to earth

source: །ས་ལ་སྨོན་མེད་འདུ་ཤེས་ཤིང་།
en: “Those who perceive the absence of wishes related to earth

source: །ས་ལ་གནས་མེད་འདུ་ཤེས་ཤིང་།
en: “Those who perceive that earth is nonabiding And realize this without adopting Or entertaining ideas about it Or earth’s other qualities—

source: །འགྲོ་བ་མེད་དང་འོང་མེད་དང་། །མཐའ་མེད་དང་ནི་ཟད་མེད་དང་། །མཚུངས་པར་ལྡན་དང་མཚུངས་མི་ལྡན།
en: “Such as its absence of coming and going, Its absence of limit and exhaustion, Its concurrence and nonconcurrence,

source: །མིང་དང་ཡི་གེ་བརྟགས་བྲལ་དང་། །སོ་སོར་བརྟགས་དང་འཇུག་པ་དང་། །གཉེན་པོ་མི་འཐུན་ཕྱོགས་མེད་དང་། །བརྗོད་དུ་མེད་ཅིང་བསྟན་མེད་དང་། །རབ་དབེན་གནས་པ་མེད་པ་དང་། །དྲན་པ་ཉེར་གཞག་ཡང་དག་སྤོང་།
en: Its freedom from the imputation of words and letters, “Its discernment, its cognition, Its freedom from improper antidotes, Its inexpressible nature, its undefinable nature, Its detached nature, and its groundless nature, “As well as the applications of mindfulness, the exertions,

source: །རྫུ་འཕྲུལ་རྐང་དང་དབང་པོ་སྟོབས། །བྱང་ཆུབ་ཡན་ལག་མི་འཇིགས་ལམ། །དེ་ལྟར་སའི་ཆོས་རྣམས་ལ།
en: The bases of miraculous power, the powers , the strengths,

source: །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ།
en: The factors of awakening, fearlessness, and the path—

source: །གལ་ཏེ་བདག་ལ་འཇུག་མེད་པས།
en: “Since the self is beyond engagement, Those who realize it in that way

source: །གལ་ཏེ་བདག་ལ་འབྱུང་མེད་པས།
en: “Since the self is beyond origination, Those who realize it in that way

source: །གལ་ཏེ་བདག་ལ་མཚན་མེད་པས།
en: “Since the self is beyond marks, Those who realize it in that way

source: །གལ་ཏེ་བདག་ལ་སྨོན་མེད་པས།
en: “Since the self is beyond wishes, Those who realize it in that way

source: །གལ་ཏེ་བདག་ལ་གནས་མེད་པས།
en: “Since the self is groundless, Those who realize it in that way

source: །གལ་ཏེ་བདག་ལ་སྐྱེ་མེད་པས།
en: “Since the self is unborn, Those who realize it in that way

source: །གལ་ཏེ་བདག་ལ་འགག་མེད་པས།
en: “Since the self is unceasing, Those who realize it in that way

source: །གལ་ཏེ་བདག་ལ་ཡིག་མེད་པས།
en: “Since the self is beyond words, Those who realize it in that way

source: །གལ་ཏེ་བདག་ནི་ཡིག་བྲལ་བས།
en: “Since the self is free from words, Those who realize it in that way

source: །མིག་གི་སྔོན་དང་ཕྱི་མཐའ་དག །རྟག་ཆད་དག་ནི་སྤངས་པ་དང་། །རྒྱུ་རྐྱེན་རང་བཞིན་སྟོང་བར་ནི། །འདྲེན་པས་ཐབས་ཀྱིས་བསྟན་རིག་བྱོས།
en: That the eye’s past and future limits Transcend eternalism and nihilism, And that its causes and conditions are intrinsically empty. “Those who conceive of the eye’s characteristics

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ།
en: While teaching the Dharma

source: །མིག་གི་མཚན་ཉིད་རྟོག་བྱེད་ན།
en: Are entertaining false concepts;

source: །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཡང་དག་ཆོས་བསྟན་ཞེས་མི་བྱ།
en: Therefore, it cannot be said that they teach the true Dharma. “Those who conceive of the eye’s characteristics

source: །གལ་ཏེ་ཆོས་ནི་སེམས་པའི་ཚེ། །མིག་གི་མཚན་ཉིད་རྟོག་བྱེད་ན།
en: While contemplating the Dharma

source: །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས།
en: Are entertaining false concepts;

source: །ཆོས་སེམས་པ་ཞེས་མི་བྱའོ།
en: Therefore, it cannot be said that they contemplate the Dharma. “Those who conceive of the eye’s characteristics

source: །གལ་ཏེ་ཆོས་ནི་སྒོམ་པའི་ཚེ། །མིག་གི་མཚན་ཉིད་རྟོག་བྱེད་ན།
en: While practicing the Dharma

source: །ཆོས་སྒོམ་པ་ཞེས་མི་བྱའོ།
en: Therefore, it cannot be said that they practice the Dharma. “The Buddha always teaches the Dharma directly To those persons

source: །གང་ཞིག་མིག་གི་སྟོང་ཉིད་རྟོགས།
en: Who realize the eye’s emptiness

source: །བྱང་ཆུབ་གཞོལ་བར་མི་བྱེད་ན། །སངས་རྒྱས་གང་ཟག་དེ་དག་ལ། །རྟག་ཏུ་མངོན་སུམ་ཆོས་སྟོན་མཛད།
en: But do not strive for awakening.

source: །གལ་ཏེ་མིག་ནི་མ་རྟོགས་ན།
en: “If the eye is not understood,

source: །གཟུགས་ཀྱང་རྟོགས་པར་མི་འགྱུར་ལ།
en: Forms will not be understood either,

source: །གལ་ཏེ་མིག་ནི་རྟོགས་གྱུར་ན།
en: But if the eye is understood,

source: །གཟུགས་ཀྱང་རབ་ཏུ་རྟོགས་པར་འགྱུར།
en: Forms will also be understood.

source: །གཟུགས་ཀྱང་རབ་ཏུ་རྟོགས་འགྱུར་ལ།
en: Forms will also be understood,

source: །གལ་ཏེ་གཟུགས་ནི་རྟོགས་གྱུར་ན།
en: And if forms are understood,

source: །མིག་ཀྱང་རབ་ཏུ་རྟོགས་པར་འགྱུར།
en: The eye will also be understood. “The same should be applied to the ear, the nose,

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །རྒྱུ་ཡི་མཚན་ཉིད་རྟོག་བྱེད་ན།
en: While teaching the Dharma

source: །ཆོས་སྟོན་པ་ཞེས་མི་བྱའོ།
en: Therefore, it cannot be said that they teach the Dharma. “Those who conceive of the characteristics of results

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །འབྲས་བུའི་མཚན་ཉིད་རྟོག་བྱེད་ན།
en: While teaching the Dharma

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །ལམ་གྱི་མཚན་ཉིད་རྟོག་བྱེད་ན།
en: While teaching the Dharma

source: །སྟོང་པའི་མཚན་ཉིད་རྟོག་བྱེད་ན།
en: Are entertaining false concepts;

source: །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་བྱའོ།
en: Therefore, it cannot be said that they teach the Dharma. “Those who conceive of the accumulations

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །བསགས་པ་དག་ཏུ་རྟོག་བྱེད་ན།
en: While teaching the Dharma

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །རྫས་ཀྱི་དངོས་པོར་རྟོག་བྱེད་ན།
en: While teaching the Dharma

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །མིག་གི་འཛིན་པར་རྟོག་བྱེད་ན།
en: While teaching the Dharma

source: །མིག་ནི་ཤེས་པར་མ་གྱུར་ན།
en: “If the eye is not understood,

source: །འདོད་ཆགས་དག་ནི་སྐྱེ་བར་འགྱུར།
en: Desires will arise,

source: །གལ་ཏེ་མིག་ནི་ཤེས་གྱུར་ན།
en: But if the eye is understood,

source: །འདོད་ཆགས་དག་ནི་སྐྱེ་མི་འགྱུར།
en: Desires will not arise. “The same should be applied to the ear, the nose,

source: །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །ཁམས་ནི་སྣ་ཚོགས་རྟོག་བྱེད་ན།
en: While teaching the Dharma

source: །ཡི་དམ་དག་ནི་མི་ཉམས་ཤིང་།
en: “Those who do not forsake their commitments

source: །ངོ་བོ་ཉིད་སྟོང་རྟོགས་པ་དང་། །ཏིང་འཛིན་སྒོ་རྣམས་ཐོབ་གྱུར་པ།
en: But have realized the empty essence And have achieved the gateways of absorption

source: །དེས་ནི་ཆོས་ལེགས་སྟོན་པར་འགྱུར།
en: Will teach the Dharma properly.

source: །མིག་ལ་རྟོག་པ་སྤངས་པ་ནི།
en: And have abandoned all notions about the eye

source: །རྣམ་རྟོག་མེད་པར་གྱུར་པའི་ཕྱིར།
en: Are free from concepts,

source: །མིག་ཉིད་སྟོང་པར་མ་ཤེས་ན།
en: “Those who do not know that the eye is empty

source: །མིག་གི་རང་བཞིན་དག་ལ་རྨོངས།
en: Are deluded about the eye’s nature.

source: །འདི་ལྟར་ཁོང་དུ་མ་ཆུད་ཕྱིར།
en: Because of this lack of comprehension,
